 


; traditional chinese
[950]
BS84C12CA_CTOUCH=BS84C12CA 觸控包
Simple prompt message=此軟件包可設置參數，讀取按鍵數據。
Debounce in output key status=設定去抖次數(值越大，按鍵反應越慢)以 10mS 為單位(判斷_SCAN_CYCLEF 標誌位)計 l 數一次，每階增加 10 mS。當 DebounceTimes=0 時時間最短，為 60mS-80mS。
auto calibration period select 80ms to 1280ms.The faster speed the better the anti-interference and the worse the sensitivity.The slower speed the worse the anti-interference and the better the sensitivity=自動校準週期選擇80ms到1280ms。
Sensitive double up,0-Normal  1-High Sensitive=感度设置,0-正常感度 1-高感度
key holding time ,if time out will reset key status to non-press,Range is 4S~60S or Disable the function=按鍵保持時間，如果超過時間將重置按鍵狀態為非按下，範圍為4s~60s或禁用功能
enalbe hardware hopping function=設定硬體自動跳頻開啓或關閉,0-關閉,1-開啓
Only one or all key active at the same time=設定單鍵輸出功能，設為 0 時，按多個觸摸鍵都有對應的按鍵旗標輸出。設為 1 時，按多個觸摸鍵只有一個鍵成立，最先成立的鍵為1，若超過 3 個(含)以上的鍵被按下，則視為所有觸摸鍵都無效。
Low power mode=低功耗模式，0-關閉,1-開啓
Touch key Moving Calibration keys easier to operate=設定動態更新環境功能，0-觸摸鍵按下後不更新〝參考值〞1-動態更新〝參考值〞，不論是否有觸摸鍵成立，都依當前環境進行校正。
Touch frequency selection=設定觸摸按鍵振蕩頻率，設為 0 時，是選擇 3M 和 7M 的觸摸按鍵振蕩頻率(可以串小於 1k 電阻)。設為 1 時，是選擇 3M 和 11M 的觸摸按鍵振蕩頻率(不建議串電阻)。設為 2 時，是選擇 1M 和 3M 的觸摸按鍵振蕩頻率。
DebounceTimes=按鍵去抖
AutoCalibrationPeriod=自動校準時間
HighSensitive=高感度
MaximumKeyHoldTime=按鍵最長反應時間
AutoFrequencyHopping=自動跳頻
OneKeyActive=單鍵輸出
PowerSave=省電功能
TKL_MovingCalibration=動態更新環境
MainFreqSelect=觸摸按鍵振蕩頻率

suggestion range 12 ~ 63=設定觸發閥值，值越大，感度越低；值越小，感度越高,建議範圍12 ~ 63
sleep mode work Touch= 休眠時對應按鍵能夠喚醒，enable-開啓喚醒功能，disable-關閉

Key1Threshold=Key1門檻值
__KEY1_WAKE=KEY1喚醒
Key2Threshold=Key2門檻值
__KEY2_WAKE=KEY2喚醒
Key3Threshold=Key3門檻值
__KEY3_WAKE=KEY3喚醒
Key4Threshold=Key4門檻值
__KEY4_WAKE=KEY4喚醒
Key5Threshold=Key5門檻值
__KEY5_WAKE=KEY5喚醒
Key6Threshold=Key6門檻值
__KEY6_WAKE=KEY6喚醒
Key7Threshold=Key7門檻值
__KEY7_WAKE=KEY7喚醒
Key8Threshold=Key8門檻值
__KEY8_WAKE=KEY8喚醒
Key9Threshold=Key9門檻值
__KEY9_WAKE=KEY9喚醒
Key10Threshold=Key10門檻值
__KEY10_WAKE=KEY10喚醒
Key11Threshold=Key11門檻值
__KEY11_WAKE=KE11Y喚醒
Key12Threshold=Key12門檻值
__KEY12_WAKE=KEY12喚醒
Key13Threshold=Key13門檻值
__KEY13_WAKE=KEY13喚醒
Key14Threshold=Key14門檻值
__KEY14_WAKE=KEY14喚醒
Key15Threshold=Key15門檻值
__KEY15_WAKE=KEY15喚醒
Key16Threshold=Key16門檻值
__KEY16_WAKE=KEY16喚醒
Key17Threshold=Key17門檻值
__KEY17_WAKE=KEY17喚醒
Key18Threshold=Key18門檻值
__KEY18_WAKE=KEY18喚醒
Key19Threshold=Key19門檻值
__KEY19_WAKE=KEY19喚醒
Key20Threshold=Key20門檻值
__KEY20_WAKE=KEY20喚醒
Key21Threshold=Key21門檻值
__KEY21_WAKE=KEY21喚醒
Key22Threshold=Key22門檻值
__KEY22_WAKE=KEY22喚醒
Key23Threshold=Key23門檻值
__KEY23_WAKE=KEY23喚醒
Key24Threshold=Key24門檻值
__KEY24_WAKE=KEY24喚醒
Key25Threshold=Key25門檻值
__KEY25_WAKE=KEY25喚醒
Key26Threshold=Key26門檻值
__KEY26_WAKE=KEY26喚醒
Key27Threshold=Key27門檻值
__KEY27_WAKE=KEY27喚醒
Key28Threshold=Key28門檻值
__KEY28_WAKE=KEY28喚醒





; simplified chinese
[936]
BS84C12CA_CTOUCH=BS84C12CA触控包
Simple prompt message= 此软件包可设置参数，读取按键数据。
Debounce in output key status=设定去抖次数(值越大，按键反应越慢)以 10mS 为单位(判断_SCAN_CYCLEF 标志位)计 l 数一次，每阶增加 10 mS。当 DebounceTimes=0 时时间最短，为 60mS-80mS。
auto calibration period select 80ms to 1280ms.The faster speed the better the anti-interference and the worse the sensitivity.The slower speed the worse the anti-interference and the better the sensitivity=自动校准周期选择80ms到1280ms。
Sensitive double up,0-Normal  1-High Sensitive=感度設定,0-正常模式 1-高感度
key holding time ,if time out will reset key status to non-press,Range is 4S~60S or Disable the function=按键保持时间,如果超时将重置按键状态为非按下,范围为4S~60S或禁用功能
enalbe hardware hopping function=设定硬体自动跳频开启或关闭，0-关闭，1-开启
Only one or all key active at the same time=设定单键输出功能，设置为0时，按多个按键都有对应的按键标志输出。设为1时，按多个按键只有一个键成立，最先成立的键为1，若超过3个（含）以上的键被按下，则视为所有的触摸键都无效.
Low power mode=低功耗模式，0-关闭，1-开启
Touch key Moving Calibration keys easier to operate=设定动态更新环境功能，0-触摸键按下后不更新〝参考值〞1-动态更新〝参考值〞，不论是否有触摸键成立，都依当前环境进行校正。
Touch frequency selection=设定触摸按键振荡频率，设为 0 时，是选择 3M 和 7M 的触摸按键振荡频率(可以串小于 1k 电阻)。设为 1 时，是选择 3M 和 11M 的触摸按键振荡频率(不建议串电阻)。设为 2 时，是选择 1M 和 3M 的触摸按键振荡频率。
DebounceTimes=按键去抖
AutoCalibrationPeriod=自动校准时间
HighSensitive=高感度
MaximumKeyHoldTime=按键最长反应时间
AutoFrequencyHopping=自动跳频
OneKeyActive=单键输出
PowerSave=省电功能
TKL_MovingCalibration=动态更新环境
MainFreqSelect=触摸按键振荡频率

suggestion range 12 ~ 63=设定触发阀值，值越大，感度越低；值越小，感度越高,建议范围12 ~ 63
sleep mode work Touch=休眠时对应按键能够唤醒，enable为开启唤醒功能，disable为关闭唤醒功能

Key1Threshold=Key1门槛值
__KEY1_WAKE=KEY1唤醒
Key2Threshold=Key2门槛值
__KEY2_WAKE=KEY2唤醒
Key3Threshold=Key3门槛值
__KEY3_WAKE=KEY3唤醒
Key4Threshold=Key4门槛值
__KEY4_WAKE=KEY4唤醒
Key5Threshold=Key5门槛值
__KEY5_WAKE=KEY5唤醒
Key6Threshold=Key6门槛值
__KEY6_WAKE=KEY6唤醒
Key7Threshold=Key7门槛值
__KEY7_WAKE=KEY7唤醒
Key8Threshold=Key8门槛值
__KEY8_WAKE=KEY8唤醒
Key9Threshold=Key9门槛值
__KEY9_WAKE=KEY9唤醒
Key10Threshold=Key10门槛值
__KEY10_WAKE=KEY10唤醒
Key11Threshold=Key11门槛值
__KEY11_WAKE=KE11Y唤醒
Key12Threshold=Key12门槛值
__KEY12_WAKE=KEY12唤醒
Key13Threshold=Key13门槛值
__KEY13_WAKE=KEY13唤醒
Key14Threshold=Key14门槛值
__KEY14_WAKE=KEY14唤醒
Key15Threshold=Key15门槛值
__KEY15_WAKE=KEY15唤醒
Key16Threshold=Key16门槛值
__KEY16_WAKE=KEY16唤醒
Key17Threshold=Key17门槛值
__KEY17_WAKE=KEY17唤醒
Key18Threshold=Key18门槛值
__KEY18_WAKE=KEY18唤醒
Key19Threshold=Key19门槛值
__KEY19_WAKE=KEY19唤醒
Key20Threshold=Key20门槛值
__KEY20_WAKE=KEY20唤醒
Key21Threshold=Key21门槛值
__KEY21_WAKE=KEY21唤醒
Key22Threshold=Key22门槛值
__KEY22_WAKE=KEY22唤醒
Key23Threshold=Key23门槛值
__KEY23_WAKE=KEY23唤醒
Key24Threshold=Key24门槛值
__KEY24_WAKE=KEY24唤醒
Key25Threshold=Key25门槛值
__KEY25_WAKE=KEY25唤醒
Key26Threshold=Key26门槛值
__KEY26_WAKE=KEY26唤醒
Key27Threshold=Key27门槛值
__KEY27_WAKE=KEY27唤醒
Key28Threshold=Key28门槛值
__KEY28_WAKE=KEY28唤醒


; English
[1252]
BS84C12CA_CTOUCH=BS84C12CA Touch
Simple prompt message=This package can set parameters and read key data.
Debounce in output key status=Set the number of de-shaking (the larger the value, the slower the key response) to 10mS as a unit (judge _SCAN_CYCLEF flag bit) count l times, each step increases by 10mS. The shortest time is 60mS-80mS when DebounceTimes=0.
auto calibration period select 80ms to 1280ms.The faster speed the better the anti-interference and the worse the sensitivity.The slower speed the worse the anti-interference and the better the sensitivity=auto calibration period select 80ms to 1280ms.
Sensitive double up,0-Normal  1-High Sensitive=Sensitive double up,0-Normal  1-High Sensitive
key holding time ,if time out will reset key status to non-press,Range is 4S~60S or Disable the function=key holding time ,if time out will reset key status to non-press,Range is 4S~60S or Disable the function
enalbe hardware hopping function=Set single-key output function, set to 0, press multiple touch keys will have corresponding button flag output. When set to 1, and the key with the largest variable is valid. If more than 3 (or more) keys are pressed, all touch keys are considered invalid
Only one or all key active at the same time=Only one or all key active at the same time
Low power mode=Low power mode 
Touch key Moving Calibration keys easier to operate=Set dynamic update environment function, 0- Do not update the "reference value" after the touch key is pressed 1- Dynamic update the "reference value", no matter whether the touch key is established or not, it will be corrected according to the current environment.
Touch frequency selection=Set the touch button oscillation frequency, set to 0, is the choice of 3M and 7M touch button oscillation frequency (can string less than 1k resistance). When set to 1, it is the choice of 3M and 11M touch button oscillation frequency (string resistance is not recommended). When set to 2, it is to select the touch button oscillation frequency of 1M and 3M.
DebounceTimes=DebounceTimes
AutoCalibrationPeriod=AutoCalibrationPeriod
HighSensitive=HighSensitive
MaximumKeyHoldTime=MaximumKeyHoldTime
AutoFrequencyHopping=AutoFrequencyHopping
OneKeyActive=OneKeyActive
PowerSave=PowerSave
TKL_MovingCalibration=TKL_MovingCalibration
MainFreqSelect=MainFreqSelect

suggestion range 12 ~ 63=Set the trigger threshold, the larger the value, the lower the sensitivity.A smaller value indicates a higher sensitivity. The recommended range is 12 to 63
sleep mode work Touch=The corresponding key can wake up during sleep
